Community-PIO-CH32V/platform-ch32v/misc/svd/CH32X035.svd
		<register>
          <name>CFGXR</name>
          <displayName>CFGXR</displayName>
          <description>Port configuration register extension
          (GPIOn_CFGXR)</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x44444444</resetValue>
          <fields>
            <field>
              <name>MODE16</name>
              <description>Port n.16 mode bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF16</name>
              <description>Port n.16 configuration
              bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE17</name>
              <description>Port n.17 mode bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF17</name>
              <description>Port n.17 configuration
              bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE18</name>
              <description>Port n.18 mode bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF18</name>
              <description>Port n.18 configuration
              bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE19</name>
              <description>Port n.19 mode bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF19</name>
              <description>Port n.19 configuration
              bits</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE20</name>
              <description>Port n.20 mode bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF20</name>
              <description>Port n.20 configuration
              bits</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE21</name>
              <description>Port n.21 mode bits</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF21</name>
              <description>Port n.21 configuration
              bits</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE22</name>
              <description>Port n.22 mode bits</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF22</name>
              <description>Port n.22 configuration
              bits</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE23</name>
              <description>Port n.23 mode bits</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF23</name>
              <description>Port n.23 configuration
              bits</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>BSXR</name>
          <displayName>BSXR</displayName>
          <description>Port bit set/reset register
          (GPIOn_BSXR)</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BS16</name>
              <description>Set bit 16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>BS17</name>
              <description>Set bit 17</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>BS18</name>
              <description>Set bit 18</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>BS19</name>
              <description>Set bit 19</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>BS20</name>
              <description>Set bit 20</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>BS21</name>
              <description>Set bit 21</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>BS22</name>
              <description>Set bit 22</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>BS23</name>
              <description>Set bit 23</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>BR16</name>
              <description>Reset bit 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>BR17</name>
              <description>Reset bit 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>BR18</name>
              <description>Reset bit 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>BR19</name>
              <description>Reset bit 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>BR20</name>
              <description>Reset bit 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>BR21</name>
              <description>Reset bit 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>BR22</name>
              <description>Reset bit 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>BR23</name>
              <description>Reset bit 23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
          </fields>
        </register>
