Community-PIO-CH32V/platform-ch32v/misc/svd/CH32X035.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USBFS</name>
      <description>USB register</description>
      <groupName>USBFS</groupName>
      <baseAddress>0x40023400</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USBFS</name>
        <description>USBFS</description>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>USBFS_WKUP</name>
        <description>USBFS_WKUP</description>
        <value>46</value>
      </interrupt>
      <registers>
        <register>
          <name>BASE_CTRL</name>
          <description>USB base control</description>
          <addressOffset>0x00</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x06</resetValue>
          <fields>
            <field>
              <name>RB_UC_DMA_EN</name>
              <description>DMA enable and DMA interrupt enable for USB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RB_UC_CLR_ALL</name>
              <description>force clear FIFO and count of USB</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RB_UC_RST_SIE</name>
              <description>force reset USB SIE, need software clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RB_UC_INT_BUSY</name>
              <description>enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RB_SYS_MODE</name>
              <description>RB_SYS_MODE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RB_UC_LOW_SPEED</name>
              <description>RB_UC_LOW_SPEED</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RB_UC_HOST_MODE</name>
              <description>enable USB host mode: 0=device mode, 1=host mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_CTRL_UDEV_CTRL</name>
          <description>USB HOST control_UDEV_CTRL</description>
          <addressOffset>0x01</addressOffset>
          <size>0x08</size>
		  <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RB_UH_PORT_EN</name>
              <description>RB_UH_PORT_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RB_UH_BUS_RESET</name>
              <description>RB_UH_BUS_RESET</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RB_UH_LOW_SPEED</name>
              <description>RB_UH_LOW_SPEED</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RB_UH_DM_PIN</name>
              <description>RB_UH_DM_PIN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RB_UH_DP_PIN</name>
              <description>RB_UH_DP_PIN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RB_UH_PD_DIS</name>
              <description>RB_UH_PD_DIS</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_EN</name>
          <description>USB interrupt enable</description>
          <addressOffset>0x02</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RB_UIE_BUS_RST__RB_UIE_DETECT</name>
              <description>enable interrupt for USB bus reset event for USB device mode;enable interrupt for USB device detected event for USB host mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RB_UIE_TRANSFER</name>
              <description>enable interrupt for USB transfer completion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RB_UIE_SUSPEND</name>
              <description>enable interrupt for USB suspend or resume event</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RB_UIE_SOF_ACT</name>
              <description>indicate host SOF timer action status for USB host</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RB_UIE_FIFO_OV</name>
              <description>enable interrupt for FIFO overflow</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RB_UIE_DEV_NAK</name>
              <description>RB_UIE_DEV_NAK</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RB_UIE_DEV_SOF</name>
              <description>RB_UIE_DEV_SOF</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV_ADDR</name>
          <description>USB device address</description>
          <addressOffset>0x03</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>MASK_USB_ADDR</name>
              <description>bit mask for USB device address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS_ST</name>
          <description>USB_MIS_ST</description>
          <addressOffset>0x05</addressOffset>
          <size>0x08</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RB_UMS_DEV_ATTACH</name>
              <description>RB_UMS_DEV_ATTACH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>RB_UMS_DM_LEVEL</name>
              <description>RB_UMS_DM_LEVEL</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>RB_UMS_SUSPEND</name>
              <description>RB_UMS_SUSPEND</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>RB_UMS_BUS_RST</name>
              <description>RB_UMS_BUS_RST</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>RB_UMS_R_FIFO_RDY</name>
              <description>RB_UMS_R_FIFO_RDY</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>RB_UMS_SIE_FREE</name>
              <description>RB_UMS_SIE_FREE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>RB_UMS_SOF_ACT</name>
              <description>RB_UMS_SOF_ACT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>RB_UMS_SOF_PRES</name>
              <description>RB_UMS_SOF_PRES</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_FG</name>
          <description>USB_INT_FG</description>
          <addressOffset>0x06</addressOffset>
          <size>0x08</size>
          <resetValue>0x20</resetValue>
          <fields>
            <field>
              <name>RB_UIF_BUS_RST_RB_UIF_DETECT</name>
              <description>RB_UIF_BUS_RST_RB_UIF_DETECT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>RB_UIF_TRANSFER</name>
              <description>RB_UIF_TRANSFER</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>RB_UIF_SUSPEND</name>
              <description>RB_UIF_SUSPEND</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>RB_UIF_HST_SOF</name>
              <description>RB_UIF_HST_SOF</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>RB_UIF_FIFO_OV</name>
              <description>RB_UIF_FIFO_OV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>RB_U_SIE_FREE</name>
              <description>RB_U_SIE_FREE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>TOG_MATCH_SYNC</name>
              <description>TOG_MATCH_SYNC</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>RB_U_IS_NAK</name>
              <description>RB_U_IS_NAK</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
          </fields>
        </register>
		<register>
          <name>INT_ST</name>
          <description>USB_INT_ST</description>
          <addressOffset>0x07</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>MASK_UIS_H_RES_MASK_UIS_ENDP</name>
              <description>MASK_UIS_H_RES_MASK_UIS_ENDP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>MASK_UIS_TOKEN</name>
              <description>MASK_UIS_TOKEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>RB_UIS_TOG_OK</name>
              <description>RB_UIS_TOG_OK</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>SETUP_ACT</name>
              <description>SETUP_ACT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_LEN</name>
          <description>USB_RX_LEN</description>
          <addressOffset>0x08</addressOffset>
          <size>0x10</size>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>USB_RX_LEN</name>
              <description>USB_RX_LEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
			  <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UEP4_1_MOD</name>
          <description>UEP4_1_MOD</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x08</size>
		  <resetValue>0x00</resetValue>
          <fields>
			<field>
              <name>EP4_T_EN</name>
              <description>EP4_T_EN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP4_R_EN</name>
              <description>EP4_R_EN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP1_BUF_MOD</name>
              <description>EP1_BUF_MOD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP1_T_EN</name>
              <description>EP1_T_EN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP1_R_EN</name>
              <description>EP1_R_EN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>UEP2_3_MOD_HOST_EP_MOD</name>
          <description>UEP2_3_MOD_HOST_EP_MOD</description>
          <addressOffset>0x0D</addressOffset>
          <size>0x08</size>
		  <resetValue>0x00</resetValue>
          <fields>
			<field>
              <name>EP2_BUF_MOD_RB_UH_EP_RBUF_MOD</name>
              <description>EP2_BUF_MOD_RB_UH_EP_RBUF_MOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP2_T_EN</name>
              <description>EP2_T_EN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP2_R_EN_RB_UH_EP_RX_EN</name>
              <description>EP2_R_EN_RB_UH_EP_RX_EN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP3_BUF_MOD_RB_UH_EP_TBUF_MOD</name>
              <description>EP1_BUF_MOD_RB_UH_EP_TBUF_MOD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP3_T_EN_RB_UH_EP_TX_EN</name>
              <description>EP1_T_EN_RB_UH_EP_TX_EN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP3_R_EN</name>
              <description>EP1_R_EN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>UEP567_MOD</name>
          <description>UEP567_MOD</description>
          <addressOffset>0x0E</addressOffset>
          <size>0x08</size>
		  <resetValue>0x00</resetValue>
          <fields>
			<field>
              <name>EP5_T_EN</name>
              <description>EP5_T_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP5_R_EN</name>
              <description>EP5_R_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP6_T_EN</name>
              <description>EP6_T_EN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP6_R_EN</name>
              <description>EP6_R_EN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP7_T_EN</name>
              <description>EP7_T_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP7_R_EN</name>
              <description>EP7_R_EN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UEP0_DMA</name>
          <description>UEP0_DMA</description>
          <addressOffset>0x10</addressOffset>
          <size>0X20</size>
		  <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EP0_BUF_ADDR</name>
              <description>EP0_BUF_ADDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>UEP1_DMA</name>
          <description>UEP1_DMA</description>
          <addressOffset>0x14</addressOffset>
          <size>0X20</size>
		  <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EP1_BUF_ADDR</name>
              <description>EP1_BUF_ADDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>UEP2_DMA_HOST_RX_DMA</name>
          <description>UEP2_DMA_HOST_RX_DMA</description>
          <addressOffset>0x18</addressOffset>
          <size>0X20</size>
		  <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EP2_BUF_ADDR_UH_RX_DMA</name>
              <description>EP2_BUF_ADDR_UH_RX_DMA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>UEP3_DMA_HOST_TX_DMA</name>
          <description>UEP3_DMA_HOST_TX_DMA</description>
          <addressOffset>0x1C</addressOffset>
          <size>0X20</size>
		  <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EP3_BUF_ADDR_UH_TX_DMA</name>
              <description>EP3_BUF_ADDR_UH_TX_DMA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UEP0_TX_LEN</name>
          <description>UEP0_TX_LEN</description>
          <addressOffset>0x20</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>EP0_T_LEN</name>
              <description>EP0_T_LEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UEP0_CTRL_H</name>
          <description>UEP0_CTRL_H</description>
          <addressOffset>0x22</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
			<field>
              <name>EP0_T_RES</name>
              <description>EP0_T_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP0_R_RES</name>
              <description>EP0_R_RES</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP0_T_TOG</name>
              <description>EP0_T_TOG</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP0_R_TOG</name>
              <description>EP0_R_TOG</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UEP1_TX_LEN</name>
          <description>UEP1_TX_LEN</description>
          <addressOffset>0x24</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>EP1_T_LEN</name>
              <description>EP1_T_LEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
