Community-PIO-CH32V/platform-ch32v/misc/svd/CH32X035.svd
        <register>
          <name>UEP1_CTRL_H_HOST_SETUP</name>
          <description>UEP1_CTRL_H_HOST_SETUP</description>
          <addressOffset>0x26</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
			<field>
              <name>EP1_T_RES</name>
              <description>EP1_T_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP1_R_RES</name>
              <description>EP1_R_RES</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP1_TOG_AUTO</name>
              <description>EP1_TOG_AUTO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP1_T_TOG_RB_UH_SOF_EN</name>
              <description>EP1_T_TOG_RB_UH_SOF_EN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP1_R_TOG_RB_UH_PRE_PID_EN</name>
              <description>EP1_R_TOG_RB_UH_PRE_PID_EN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UEP2_TX_LEN</name>
          <description>UEP2_TX_LEN</description>
          <addressOffset>0x28</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>EP2_T_LEN</name>
              <description>EP2_T_LEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UEP2_CTRL_H</name>
          <description>UEP2_CTRL_H</description>
          <addressOffset>0x2A</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
			<field>
              <name>EP2_T_RES</name>
              <description>EP2_T_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP2_R_RES</name>
              <description>EP2_R_RES</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP2_TOG_AUTO</name>
              <description>EP2_TOG_AUTO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP2_T_TOG</name>
              <description>EP2_T_TOG</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP2_R_TOG</name>
              <description>EP2_R_TOG</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>UEP3_TX_LEN</name>
          <description>UEP3_TX_LEN</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>EP3_T_LEN</name>
              <description>EP3_T_LEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>UEP3_CTRL_H</name>
          <description>UEP3_CTRL_H</description>
          <addressOffset>0x2E</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
			<field>
              <name>EP3_T_RES</name>
              <description>EP3_T_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP3_R_RES</name>
              <description>EP3_R_RES</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP3_TOG_AUTO</name>
              <description>EP3_TOG_AUTO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP3_T_TOG</name>
              <description>EP3_T_TOG</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP3_R_TOG</name>
              <description>EP3_R_TOG</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UEP4_TX_LEN</name>
          <description>UEP4_TX_LEN</description>
          <addressOffset>0x30</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>EP4_T_LEN</name>
              <description>EP4_T_LEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UEP4_CTRL_H</name>
          <description>UEP4_CTRL_H</description>
          <addressOffset>0x32</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
			<field>
              <name>EP4_T_RES</name>
              <description>EP4_T_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP4_R_RES</name>
              <description>EP4_R_RES</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP4_T_TOG</name>
              <description>EP4_T_TOG</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP4_R_TOG</name>
              <description>EP4_R_TOG</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UEP5_DMA</name>
          <description>UEP5_DMA</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
		  <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EP5_BUF_ADDR</name>
              <description>EP5_BUF_ADDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>UEP6_DMA</name>
          <description>UEP6_DMA</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
		  <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EP6_BUF_ADDR</name>
              <description>EP6_BUF_ADDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>UEP7_DMA</name>
          <description>UEP7_DMA</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
		  <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EP7_BUF_ADDR</name>
              <description>EP7_BUF_ADDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>UEP5_TX_LEN</name>
          <description>UEP5_TX_LEN</description>
          <addressOffset>0x64</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>EP5_T_LEN</name>
              <description>EP5_T_LEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>UEP5_CTRL_H</name>
          <description>UEP5_CTRL_H</description>
          <addressOffset>0x66</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
			<field>
              <name>EP5_T_RES</name>
              <description>EP5_T_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP5_R_RES</name>
              <description>EP5_R_RES</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP5_TOG_AUTO</name>
              <description>EP5_TOG_AUTO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP5_T_TOG</name>
              <description>EP5_T_TOG</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP5_R_TOG</name>
              <description>EP5_R_TOG</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>UEP6_TX_LEN</name>
          <description>UEP6_TX_LEN</description>
          <addressOffset>0x68</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>EP6_T_LEN</name>
              <description>EP6_T_LEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>UEP6_CTRL_H</name>
          <description>UEP6_CTRL_H</description>
          <addressOffset>0x6A</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
			<field>
              <name>EP6_T_RES</name>
              <description>EP6_T_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP6_R_RES</name>
              <description>EP6_R_RES</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP6_TOG_AUTO</name>
              <description>EP6_TOG_AUTO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP6_T_TOG</name>
              <description>EP6_T_TOG</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP6_R_TOG</name>
              <description>EP6_R_TOG</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>UEP7_TX_LEN</name>
          <description>UEP7_TX_LEN</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>EP7_T_LEN</name>
              <description>EP7_T_LEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>UEP7_CTRL_H</name>
          <description>UEP7_CTRL_H</description>
          <addressOffset>0x6E</addressOffset>
          <size>0x10</size>
		  <resetValue>0x0000</resetValue>
          <fields>
			<field>
              <name>EP7_T_RES</name>
              <description>EP7_T_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP7_R_RES</name>
              <description>EP7_R_RES</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP7_TOG_AUTO</name>
              <description>EP7_TOG_AUTO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP7_T_TOG</name>
              <description>EP7_T_TOG</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP7_R_TOG</name>
              <description>EP7_R_TOG</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>USB_EPX_CTRL</name>
          <description>USB_EPX_CTRL</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
		  <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EP_T_LEN</name>
              <description>EP5_T_LEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP_R_LEN</name>
              <description>EP5_R_LEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>EP_T_AF</name>
              <description>EP_T_AF</description>
              <bitOffset>17</bitOffset>
              <bitWidth>7</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
